{
  "plugins": {
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim",
      "version": "'v9.1.0'"
    },
    "fidget.nvim": {
      "src": "https://github.com/j-hui/fidget.nvim",
      "version": "'v1.6.1'"
    },
    "gp.nvim": {
      "src": "https://github.com/robitx/gp.nvim",
      "version": "'v3.9.0'"
    },
    "killring.nvim": {
      "src": "https://github.com/sunesimonsen/killring.nvim"
    },
    "marksman": {
      "src": "https://github.com/artempyanykh/marksman",
      "version": "'2026-02-08'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim",
      "version": "'v2.1.0'"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim",
      "version": "'443f1ef8b5e6bf47045cb2217b6f748a223cf7dc'"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim",
      "version": "'v2.2.1'"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim",
      "version": "'v0.17.0'"
    },
    "notes.nvim": {
      "src": "https://github.com/sunesimonsen/notes.nvim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig",
      "version": "'v2.7.0'"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'4916d6592ede8c07973490d9322f187e07dfefac'"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects",
      "version": "'93d60a475f0b08a8eceb99255863977d3a25f310'"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim",
      "version": "'v2.15.0'"
    },
    "project.nvim": {
      "src": "https://github.com/DrKJeff16/project.nvim",
      "version": "'v2.0.0-1'"
    },
    "typos.nvim": {
      "src": "https://github.com/poljar/typos.nvim",
      "version": "'9315badebfe72efd8020ae7b1d2f176903ea6794'"
    },
    "vim-sleuth": {
      "src": "https://github.com/tpope/vim-sleuth",
      "version": "'v2.0'"
    }
  }
}
